Tekla Open API Reference for Tekla Structures 2025
Events.ClipPlaneChanged Event
 Occurs when user deletes a clip plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ClipPlaneChangedDelegate ClipPlaneChanged
Public Event ClipPlaneChanged As Events.ClipPlaneChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ClipPlaneChangedDelegate
Implements
IEvents.ClipPlaneChanged
See Also
Reference
Events Class
Tekla.Structures.Model Namespace